/**
 * @file
 *
 * 4_2. Порядковые статистики.​ Дано число N и N строк. Каждая строка содержащит команду добавления или удаления
 * натуральных чисел, а также запрос на получение k-ой порядковой статистики. Команда добавления числа A задается
 * положительным числом A, команда удаления числа A задается отрицательным числом “-A”. Запрос на получение k-ой
 * порядковой статистики задается числом k. Требуемая скорость выполнения запроса - O(log n).
 */

#include <iostream>

int main() {
	std::cout << "Hello, World!" << std::endl;
	return 0;
}