/**
 * @file
 *
 * @brief Задача №3 (3 балла). Реклама
 *
 * В супермаркете решили оптимизировать показ рекламы. Известно расписание прихода и ухода покупателей (два целых
 * числа). Каждому покупателю необходимо показать минимум 2 рекламы. Рекламу можно транслировать только в
 * целочисленные моменты времени. Покупатель может видеть рекламу от момента прихода до момента ухода из магазина. В
 * каждый момент времени может показываться только одна реклама. Считается, что реклама показывается мгновенно. Если
 * реклама показывается в момент ухода или прихода, то считается, что посетитель успел её посмотреть. Требуется
 * определить минимальное число показов рекламы.
 *
 * Необходимо реализовать и использовать **​локальную пирамидальную сортировку** ​(без использования дополнительной
 * памяти). Общее время работы алгоритма `O(n log n)`.
 *
 * @date 06.11.2016
 */

#include <iostream>

int main() {
	std::cout << "Hello, World!" << std::endl;
	return 0;
}