/**
 * @file
 *
 * 5_2. Сортировка почти упорядоченной последовательности.
 * Дана последовательность целых чисел `a[1]`, ..., `a[n]` и натуральное число `k`, такое что для любых `i`, `j`: если
 * `j >= i + k`, то `a[i] <= a[j]`. Требуется отсортировать последовательность. Последовательность может быть очень
 * длинной. Время работы O(n * log(k)). Доп. память O(k). Использовать слияние.
 */

#include <iostream>

int main() {
	std::cout << "Hello, World!" << std::endl;
	return 0;
}